*** Settings ***

Documentation  A test suite with a tests for simple tender auction.
Suite setup       Підготовка тесту
Suite teardown    Close all browsers
Resource       resource.robot

*** Test Cases ***
Перевірка логіну
    Залогуватись користувачами

Очікування 1-ого раунду
    Дочекатистись паузи перед 1 раундом
    Перевірити інформацію про тендер
    Дочекатистись завершення паузи перед 1 раундом

1-ий раунд
    Вибрати кориcтувача, який може поставити ставку
    Поставити мінімально допустиму ставку
    Відмінитити ставку
    Поставити мінімально допустиму ставку
    Дочекатистись учасником закінчення стадії ставок
    Перевірити чи ставка була прийнята
    Вибрати кориcтувача, який може поставити ставку
    Поставити низьку ціну в ставці  1
    Поставити низьку ціну в ставці   0.01
    Поставити мінімально допустиму ставку
    Дочекатистись учасником закінчення стадії ставок

Очікування 2-ого раунду
    Дочекатистись паузи перед 2 раундом
    Дочекатистись завершення паузи перед 2 раундом

2-ий раунд
    Вибрати кориcтувача, який може поставити ставку
    Поставити мінімально допустиму ставку
    Дочекатистись учасником закінчення стадії ставок
    Перевірити чи ставка була прийнята
    Вибрати кориcтувача, який може поставити ставку
    Поставити мінімально допустиму ставку
    Дочекатистись учасником закінчення стадії ставок

Очікування 3-ого раунду
    Дочекатистись паузи перед 3 раундом
    Дочекатистись завершення паузи перед 3 раундом

3-ий раунд
    Вибрати кориcтувача, який може поставити ставку
    Поставити мінімально допустиму ставку
    Дочекатистись учасником закінчення стадії ставок
    Перевірити чи ставка була прийнята
    Вибрати кориcтувача, який може поставити ставку
    Поставити мінімально допустиму ставку
    Дочекатистись учасником закінчення стадії ставок

Завершення аукціону
    Дочекатистись до завершення аукціону без розкриття імен учасників   15 min
    Дочекатистись до завершення аукціону
